burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_pmu.h
/*!
    \file    gd32w51x_f5hc_pmu.h
    \brief   definitions for the PMU

    \version 2026-04-15, V2.0.0, firmware for gd32w51x_f5hc
*/

/*
    Copyright (c) 2026, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#ifndef gd32w51x_f5hc_PMU_H
#define gd32w51x_f5hc_PMU_H

#include "gd32w51x_f5hc.h"

/* PMU definitions */
#define PMU                           PMU_BASE                              /*!< PMU base address */

/* registers definitions */
#define PMU_CTL0                      REG32((PMU) + 0x00U)                  /*!< PMU control register 0 */
#define PMU_CS0                       REG32((PMU) + 0x04U)                  /*!< PMU control and status register 0 */
#define PMU_CTL1                      REG32((PMU) + 0x08U)                  /*!< PMU control register 1 */
#define PMU_CS1                       REG32((PMU) + 0x0CU)                  /*!< PMU control and status register 1 */
#if defined (GD32W515)
#define PMU_RFCTL                     REG32((PMU) + 0x20U)                  /*!< PMU RF control register */
#endif /* defined (GD32W515) */ 
#define PMU_SECCFG                    REG32((PMU) + 0x30U)                  /*!< PMU secure configuration register */
#define PMU_PRICFG                    REG32((PMU) + 0x34U)                  /*!< PMU privilege configuration register */
#define PMU_DSLVC_ULKKEY              REG32((PMU) + 0x104U)                 /*!< Deepsleep voltage configure unlock register */

/* bits definitions */
/* PMU_CTL0 */
#define PMU_CTL0_LDOLP                BIT(0)                                /*!< LDO low power mode */
#define PMU_CTL0_STBMOD               BIT(1)                                /*!< standby mode */
#define PMU_CTL0_WURST                BIT(2)                                /*!< wakeup flag reset */
#define PMU_CTL0_STBRST               BIT(3)                                /*!< standby flag reset */
#define PMU_CTL0_LVDEN                BIT(4)                                /*!< low voltage detector enable */
#define PMU_CTL0_LVDT                 BITS(5,7)                             /*!< low voltage detector threshold */
#define PMU_CTL0_BKPWEN               BIT(8)                                /*!< backup domain write enable */
#define PMU_CTL0_VLVDEN               BIT(9)                                /*!< vdda low voltage detect enable */
#define PMU_CTL0_LDLP                 BIT(10)                               /*!< low-driver mode when use low power LDO */
#define PMU_CTL0_LDNP                 BIT(11)                               /*!< low-driver mode when use normal power LDO */
#define PMU_CTL0_LDOVS                BITS(14,15)                           /*!< LDO output voltage select */
#define PMU_CTL0_LDEN                 BITS(18,19)                           /*!< low-driver mode enable in deep-sleep mode */
#if defined (GD32F5HC)
#define PMU_CTL0_DSLPVS               BITS(24,25)                           /*!< Deep-sleep mode voltage select */
#endif /* defined GD32F5HC */

/* PMU_CS0 */
#define PMU_CS0_WUF                   BIT(0)                                /*!< wakeup flag */
#define PMU_CS0_STBF                  BIT(1)                                /*!< standby flag */
#define PMU_CS0_LVDF                  BIT(2)                                /*!< VDD low voltage detector status flag */
#define PMU_CS0_VLVDF                 BIT(3)                                /*!< VDDA low voltage detector status flag */
#if defined (GD32F5HC)
#define PMU_CS0_WUP0_EDGE             BIT(4)                                /*!< WKUP Pin0 edge selection */
#define PMU_CS0_WUP1_EDGE             BIT(5)                                /*!< WKUP Pin1 edge selection */
#define PMU_CS0_WUP2_EDGE             BIT(6)                                /*!< WKUP Pin2 edge selection */
#define PMU_CS0_WUP3_EDGE             BIT(7)                                /*!< WKUP Pin3 edge selection */
#endif /* defined GD32F5HC */
#define PMU_CS0_WUPEN0                BIT(8)                                /*!< WKUP Pin0 (PA2) enable */
#define PMU_CS0_WUPEN1                BIT(9)                                /*!< WKUP Pin1 (PA15) enable */
#define PMU_CS0_WUPEN2                BIT(10)                               /*!< WKUP Pin2 (PB2) enable */
#define PMU_CS0_WUPEN3                BIT(11)                               /*!< WKUP Pin3 (PA12) enable */
#if defined (GD32F5HC)
#define PMU_CS0_WUPEN4                BIT(12)                               /*!< WKUP Pin4 (PD5) enable  */
#endif /* defined GD32F5HC */
#define PMU_CS0_LDOVSRF               BIT(14)                               /*!< LDO voltage select ready flag */
#if defined (GD32F5HC)
#define PMU_CS0_WUP4_EDGE             BIT(15)                               /*!< WKUP Pin4 edge selection */
#endif /* defined GD32F5HC */
#define PMU_CS0_LDRF                  BITS(18,19)                           /*!< Low-driver mode ready flag */
#if defined (GD32F5HC)
#define PMU_CS0_WUP5_EDGE             BIT(24)                               /*!< WKUP Pin0 edge selection */
#define PMU_CS0_WUP6_EDGE             BIT(25)                               /*!< WKUP Pin1 edge selection */
#define PMU_CS0_WUP7_EDGE             BIT(26)                               /*!< WKUP Pin2 edge selection */
#define PMU_CS0_WUPEN5                BIT(27)                               /*!< WKUP Pin0 (PD4) enable */
#define PMU_CS0_WUPEN6                BIT(28)                               /*!< WKUP Pin1 (PB0) enable */
#define PMU_CS0_WUPEN7                BIT(29)                               /*!< WKUP Pin2 (PD3) enable */
#endif /* defined GD32F5HC */

/* PMU_CTL1 */
#if defined (GD32W515)
#define PMU_CTL1_WPEN                 BIT(1)                                /*!< WIFI power enable */
#define PMU_CTL1_WPSLEEP              BIT(2)                                /*!< WIFI go to sleep */
#define PMU_CTL1_WPWAKE               BIT(3)                                /*!< WIFI wakeup */
#endif /* defined (GD32W515) */ 
#define PMU_CTL1_SRAM1PSLEEP          BIT(5)                                /*!< SRAM1 go to sleep */
#define PMU_CTL1_SRAM1PWAKE           BIT(6)                                /*!< SRAM1 wakeup */
#define PMU_CTL1_SRAM2PSLEEP          BIT(9)                                /*!< SRAM2 go to sleep */
#define PMU_CTL1_SRAM2PWAKE           BIT(10)                               /*!< SRAM2 wakeup */
#define PMU_CTL1_SRAM3PSLEEP          BIT(13)                               /*!< SRAM3 go to sleep */
#define PMU_CTL1_SRAM3PWAKE           BIT(14)                               /*!< SRAM3 wakeup */

