burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_pmu.h
/* PMU_CS1 */
#if defined (GD32W515)
#define PMU_CS1_WPS_SLEEP             BIT(2)                                /*!< WIFI is in sleep state */
#define PMU_CS1_WPS_ACTIVE            BIT(3)                                /*!< WIFI is in active state */
#endif /* defined (GD32W515) */ 
#define PMU_CS1_SRAM1PS_SLEEP         BIT(5)                                /*!< SRAM1 is in sleep state */
#define PMU_CS1_SRAM1PS_ACTIVE        BIT(6)                                /*!< SRAM1 is in active state */
#define PMU_CS1_SRAM2PS_SLEEP         BIT(9)                                /*!< SRAM2 is in sleep state */
#define PMU_CS1_SRAM2PS_ACTIVE        BIT(10)                               /*!< SRAM2 is in active state */
#define PMU_CS1_SRAM3PS_SLEEP         BIT(13)                               /*!< SRAM3 is in sleep state */
#define PMU_CS1_SRAM3PS_ACTIVE        BIT(14)                               /*!< SRAM3 is in active state */
#if defined (GD32W515)
/* PMU_RFCTL */
#define PMU_RFCTL_RFSWEN              BIT(0)                                /*!< RF software sequence enable */
#define PMU_RFCTL_RFFS                BIT(1)                                /*!< Software force start, open RF power */
#define PMU_RFCTL_RFFC                BIT(2)                                /*!< Software force close, close RF power */
#endif /* defined (GD32W515) */

/* PMU_SECCFG */
#define PMU_SECCFG_WUP0SEC            BIT(0)                                /*!< WKUP pin 0 security */
#define PMU_SECCFG_WUP1SEC            BIT(1)                                /*!< WKUP pin 1 security */
#define PMU_SECCFG_WUP2SEC            BIT(2)                                /*!< WKUP pin 2 security */
#define PMU_SECCFG_WUP3SEC            BIT(3)                                /*!< WKUP pin 3 security */
#if defined (GD32F5HC)
#define PMU_SECCFG_WUP4SEC            BIT(4)                                /*!< WKUP pin 4 security */
#define PMU_SECCFG_WUP5SEC            BIT(5)                                /*!< WKUP pin 5 security */
#define PMU_SECCFG_WUP6SEC            BIT(6)                                /*!< WKUP pin 6 security */
#define PMU_SECCFG_WUP7SEC            BIT(7)                                /*!< WKUP pin 7 security */
#endif /* defined GD32F5HC */
#define PMU_SECCFG_LPMSEC             BIT(8)                                /*!< Low-power mode security */
#define PMU_SECCFG_VDMSEC             BIT(9)                                /*!< Voltage detection and monitoring security */
#define PMU_SECCFG_DBPSEC             BIT(10)                               /*!< Backup domain write access security */
#define PMU_SECCFG_LPSSEC             BIT(11)                               /*!< WIFI_sleep and SRAM_sleep mode security */
#if defined (GD32W515)
#define PMU_SECCFG_RFSEC              BIT(16)                               /*!< RF security */
#endif /* defined (GD32W515) */

/* PMU_PRICFG */
#define PMU_PRICFG_PRIV               BIT(0)                                /*!< privileged access only */

/* PMU_DSLVC_ULKKEY */
#define PMU_DSLVC_ULKKEY_KEY          BITS(0,31)                            /*!< The DSLPVS unlock KEY bit field */

/* constants definitions */
/* PMU LDO definitions */
#define PMU_LDO_NORMAL                ((uint32_t)0x00000000U)               /*!< LDO normal work when PMU enter deepsleep mode */
#define PMU_LDO_LOWPOWER              PMU_CTL0_LDOLP                        /*!< LDO work at low power status when PMU enter deepsleep mode */

/* PMU low voltage detector threshold definitions */
#define CTL0_LVDT(regval)             (BITS(5,7)&((uint32_t)(regval)<<5))
#define PMU_LVDT_0                    CTL0_LVDT(0)                          /*!< voltage threshold is 2.1V */
#define PMU_LVDT_1                    CTL0_LVDT(1)                          /*!< voltage threshold is 2.3V */
#define PMU_LVDT_2                    CTL0_LVDT(2)                          /*!< voltage threshold is 2.4V */
#define PMU_LVDT_3                    CTL0_LVDT(3)                          /*!< voltage threshold is 2.6V */
#define PMU_LVDT_4                    CTL0_LVDT(4)                          /*!< voltage threshold is 2.7V */
#define PMU_LVDT_5                    CTL0_LVDT(5)                          /*!< voltage threshold is 2.9V */
#define PMU_LVDT_6                    CTL0_LVDT(6)                          /*!< voltage threshold is 3.0V */
#define PMU_LVDT_7                    CTL0_LVDT(7)                          /*!< voltage threshold is 3.1V */

/* PMU low-driver mode when use low power LDO */
#define CTL0_LDLP(regval)             (BIT(10)&((uint32_t)(regval)<<10))
#define PMU_NORMALDR_LOWPWR           CTL0_LDLP(0)                          /*!< normal driver when use low power LDO */
#define PMU_LOWDR_LOWPWR              CTL0_LDLP(1)                          /*!< low-driver mode enabled when LDEN is 11 and use low power LDO */

/* PMU low-driver mode when use normal power LDO */
#define CTL0_LDNP(regval)             (BIT(11)&((uint32_t)(regval)<<11))
#define PMU_NORMALDR_NORMALPWR        CTL0_LDNP(0)                          /*!< normal driver when use normal power LDO */
#define PMU_LOWDR_NORMALPWR           CTL0_LDNP(1)                          /*!< low-driver mode enabled when LDEN is 11 and use normal power LDO */

/* PMU LDO output voltage select definitions */
#define CTL0_LDOVS(regval)            (BITS(14,15)&((uint32_t)(regval)<<14))
#define PMU_LDOVS_LOW                 CTL0_LDOVS(0)                         /*!< LDO output voltage low mode */
#define PMU_LDOVS_HIGH                CTL0_LDOVS(2)                         /*!< LDO output voltage high mode */

/* Low-driver mode in deep-sleep mode */
#define PMU_LOWDRIVER_DISABLE         ((uint32_t)0x00000000U)               /*!< Low-driver mode disable in deep-sleep mode */
#define PMU_LOWDRIVER_ENABLE          PMU_CTL0_LDEN                         /*!< Low-driver mode enable in deep-sleep mode */

#if defined (GD32F5HC)
/* PMU deep-sleep mode voltage select definitions */
#define CTL0_DSLPVS(regval)           (BITS(24,25) & ((uint32_t)(regval) << 24U))
#define PMU_DSLPVS_0_9                CTL0_DSLPVS(0)                        /*!< core voltage is 0.9V in Deep-sleep mode */
#define PMU_DSLPVS_1_0                CTL0_DSLPVS(1)                        /*!< core voltage is 1.0V in Deep-sleep mode */
#define PMU_DSLPVS_1_1                CTL0_DSLPVS(2)                        /*!< core voltage is 1.1V in Deep-sleep mode */
#define PMU_DSLPVS_1_2                CTL0_DSLPVS(3)                        /*!< core voltage is 1.2V in Deep-sleep mode */
#endif /* defined GD32F5HC */

