burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_pmu.h
/* PMU wakeup pin definitions */
#define PMU_WAKEUP_PIN0               PMU_CS0_WUPEN0                        /*!< WKUP Pin 0 (PA2) enable */
#define PMU_WAKEUP_PIN1               PMU_CS0_WUPEN1                        /*!< WKUP Pin 1 (PA15) enable */
#define PMU_WAKEUP_PIN2               PMU_CS0_WUPEN2                        /*!< WKUP Pin 2 (PB2) enable */
#define PMU_WAKEUP_PIN3               PMU_CS0_WUPEN3                        /*!< WKUP Pin 3 (PA12) enable */
#if defined (GD32F5HC)
#define PMU_WAKEUP_PIN4               PMU_CS0_WUPEN4                        /*!< WKUP Pin 4 (PD5) enable */
#define PMU_WAKEUP_PIN5               PMU_CS0_WUPEN5                        /*!< WKUP Pin 5 (PD4) enable */
#define PMU_WAKEUP_PIN6               PMU_CS0_WUPEN6                        /*!< WKUP Pin 6 (PB0) enable */
#define PMU_WAKEUP_PIN7               PMU_CS0_WUPEN7                        /*!< WKUP Pin 7 (PD3) enable */

/* PMU wakeup pin edge selection */
#define PMU_WAKEUP_PIN0_EDGE          PMU_CS0_WUP0_EDGE                     /*!< WKUP Pin 0 (PA2) edge selection */
#define PMU_WAKEUP_PIN1_EDGE          PMU_CS0_WUP1_EDGE                     /*!< WKUP Pin 1 (PA15) edge selection */
#define PMU_WAKEUP_PIN2_EDGE          PMU_CS0_WUP2_EDGE                     /*!< WKUP Pin 2 (PB2) edge selection */
#define PMU_WAKEUP_PIN3_EDGE          PMU_CS0_WUP3_EDGE                     /*!< WKUP Pin 3 (PA12) edge selection */
#define PMU_WAKEUP_PIN4_EDGE          PMU_CS0_WUP4_EDGE                     /*!< WKUP Pin 4 (PD5) edge selection */
#define PMU_WAKEUP_PIN5_EDGE          PMU_CS0_WUP5_EDGE                     /*!< WKUP Pin 5 (PD4) edge selection */
#define PMU_WAKEUP_PIN6_EDGE          PMU_CS0_WUP6_EDGE                     /*!< WKUP Pin 6 (PB0) edge selection */
#define PMU_WAKEUP_PIN7_EDGE          PMU_CS0_WUP7_EDGE                     /*!< WKUP Pin 7 (PD3) edge selection */

/* PMU wakeup pin active edge definitions */
#define WAKEUP_PIN_EDGE_RISING        ((uint32_t)0x00000000U)               /*!< WKUP pin active on rising edge */
#define WAKEUP_PIN_EDGE_FALLING       ((uint32_t)0x00000001U)               /*!< WKUP pin active on falling edge */
#endif /* defined GD32F5HC */

/* PMU low-drive mode ready flag definitions */
#define CS0_LDRF(regval)              (BITS(18,19)&((uint32_t)(regval)<<18))
#define PMU_LDRF_NORMAL               CS0_LDRF(0)                           /*!< normal driver in deep-sleep mode */
#define PMU_LDRF_LOWDRIVER            CS0_LDRF(3)                           /*!< low-driver mode in deep-sleep mode */

/* PMU WIFI SRAM control */
#if defined (GD32W515)
#define PMU_WIFI_SLEEP                PMU_CTL1_WPSLEEP                      /*!< WIFI go to sleep */
#define PMU_WIFI_WAKE                 PMU_CTL1_WPWAKE                       /*!< WIFI wakeup */
#endif /* defined (GD32W515) */
#define PMU_SRAM1_SLEEP               PMU_CTL1_SRAM1PSLEEP                  /*!< SRAM1 go to sleep */
#define PMU_SRAM1_WAKE                PMU_CTL1_SRAM1PWAKE                   /*!< SRAM1 wakeup */
#define PMU_SRAM2_SLEEP               PMU_CTL1_SRAM2PSLEEP                  /*!< SRAM2 go to sleep */
#define PMU_SRAM2_WAKE                PMU_CTL1_SRAM2PWAKE                   /*!< SRAM2 wakeup */
#define PMU_SRAM3_SLEEP               PMU_CTL1_SRAM3PSLEEP                  /*!< SRAM3 go to sleep */
#define PMU_SRAM3_WAKE                PMU_CTL1_SRAM3PWAKE                   /*!< SRAM3 wakeup */

#if defined (GD32W515)
/* RF sequence definitions */
#define PMU_RF_HARDWARE               ((uint32_t)0x00000000U)               /*!< RF hardware sequence enable */
#define PMU_RF_SOFTWARE               PMU_RFCTL_RFSWEN                      /*!< RF software sequence enable */

/* RF force definitions */
#define PMU_RF_FORCE_OPEN             PMU_RFCTL_RFFS                        /*!< Software force start, open RF power */
#define PMU_RF_FORCE_CLOSE            PMU_RFCTL_RFFC                        /*!< Software force close, close RF power */
#endif /* defined (GD32W515) */

/* PMU security definitions */
#define PMU_SEC_WAKEUP_PIN0           PMU_SECCFG_WUP0SEC                    /*!< WKUP pin 0 security */
#define PMU_SEC_WAKEUP_PIN1           PMU_SECCFG_WUP1SEC                    /*!< WKUP pin 1 security */
#define PMU_SEC_WAKEUP_PIN2           PMU_SECCFG_WUP2SEC                    /*!< WKUP pin 2 security */
#define PMU_SEC_WAKEUP_PIN3           PMU_SECCFG_WUP3SEC                    /*!< WKUP pin 3 security */
#if defined (GD32F5HC)
#define PMU_SEC_WAKEUP_PIN4           PMU_SECCFG_WUP4SEC                    /*!< WKUP pin 4 security */
#define PMU_SEC_WAKEUP_PIN5           PMU_SECCFG_WUP5SEC                    /*!< WKUP pin 5 security */
#define PMU_SEC_WAKEUP_PIN6           PMU_SECCFG_WUP6SEC                    /*!< WKUP pin 6 security */
#define PMU_SEC_WAKEUP_PIN7           PMU_SECCFG_WUP7SEC                    /*!< WKUP pin 7 security */
#endif /* defined GD32F5HC */
#define PMU_SEC_LPLDO_DPSLP_STB       PMU_SECCFG_LPMSEC                     /*!< Low-power mode security */
#define PMU_SEC_LVD_VLVD              PMU_SECCFG_VDMSEC                     /*!< Voltage detection and monitoring security */
#define PMU_SEC_BACKUP_WRITE          PMU_SECCFG_DBPSEC                     /*!< Backup domain write access security */
#define PMU_SEC_WIFI_SRAM_CONTROL     PMU_SECCFG_LPSSEC                     /*!< WIFI_sleep and SRAM_sleep mode security */
#if defined (GD32W515)
#define PMU_SEC_RF_SEQUENCE           PMU_SECCFG_RFSEC                      /*!< RF security */
#endif /* defined (GD32W515) */

/* PMU flag definitions */
#define PMU_FLAG_WAKEUP               PMU_CS0_WUF                           /*!< wakeup flag status */
#define PMU_FLAG_STANDBY              PMU_CS0_STBF                          /*!< standby flag status */
#define PMU_FLAG_LVD                  PMU_CS0_LVDF                          /*!< LVD flag status */
#define PMU_FLAG_VLVD                 PMU_CS0_VLVDF                         /*!< VDDA low voltage flag */
#define PMU_FLAG_LDOVSRF              PMU_CS0_LDOVSRF                       /*!< LDO voltage select ready flag */
#define PMU_FLAG_LDRF                 PMU_CS0_LDRF                          /*!< low-driver mode ready flag */
#if defined (GD32W515)
#define PMU_FLAG_WIFI_SLEEP           (BIT(31) | PMU_CS1_WPS_SLEEP)         /*!< WIFI is in sleep state */
#define PMU_FLAG_WIFI_ACTIVE          (BIT(31) | PMU_CS1_WPS_ACTIVE)        /*!< WIFI is in active state */
#endif /* defined (GD32W515) */
#define PMU_FLAG_SRAM1_SLEEP          (BIT(31) | PMU_CS1_SRAM1PS_SLEEP)     /*!< SRAM1 is in sleep state */
#define PMU_FLAG_SRAM1_ACTIVE         (BIT(31) | PMU_CS1_SRAM1PS_ACTIVE)    /*!< SRAM1 is in active state */
#define PMU_FLAG_SRAM2_SLEEP          (BIT(31) | PMU_CS1_SRAM2PS_SLEEP)     /*!< SRAM2 is in sleep state */
#define PMU_FLAG_SRAM2_ACTIVE         (BIT(31) | PMU_CS1_SRAM2PS_ACTIVE)    /*!< SRAM2 is in active state */
#define PMU_FLAG_SRAM3_SLEEP          (BIT(31) | PMU_CS1_SRAM3PS_SLEEP)     /*!< SRAM3 is in sleep state */
#define PMU_FLAG_SRAM3_ACTIVE         (BIT(31) | PMU_CS1_SRAM3PS_ACTIVE)    /*!< SRAM3 is in active state */

/* PMU flag reset definitions */
#define PMU_FLAG_RESET_WAKEUP         PMU_CTL0_WURST                        /*!< wakeup flag reset */
#define PMU_FLAG_RESET_STANDBY        PMU_CTL0_STBRST                       /*!< standby flag reset */

