burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_pmu.h
/* PMU command constants definitions */
#define WFI_CMD                       ((uint8_t)0x00U)                      /*!< use WFI command */
#define WFE_CMD                       ((uint8_t)0x01U)                      /*!< use WFE command */

/* Deepsleep voltage configure unlock key  */
#define PMU_DSLPVS_UNL_KEY            ((uint32_t)0x1A2B3C4D)

/* function declarations */
/* reset PMU register */
void pmu_deinit(void);

/* LVD & PVM functions */
/* select low voltage detector threshold */
void pmu_lvd_select(uint32_t lvdt_n);
/* select deep-sleep mode core voltage */
void pmu_deepsleep_voltage_select(uint32_t voltage_n);
/* disable PMU LVD */
void pmu_lvd_disable(void);
/* enable PMU VLVD */
void pmu_vlvd_enable(void);
/* disable PMU VLVD */
void pmu_vlvd_disable(void);

/* LDO functions */
/* select LDO output voltage */
void pmu_ldo_output_select(uint32_t ldo_output);

/* set PMU mode */
/* PMU work in sleep mode */
void pmu_to_sleepmode(uint8_t sleepmodecmd);
/* PMU work in deep-sleep mode */
void pmu_to_deepsleepmode(uint32_t ldo, uint32_t lowdrive, uint8_t deepsleepmodecmd);
/* PMU work in standby mode */
void pmu_to_standbymode(void);
/* enable PMU wakeup pin */
void pmu_wakeup_pin_enable(uint32_t wakeup_pin);
/* disable PMU wakeup pin */
void pmu_wakeup_pin_disable(uint32_t wakeup_pin);
/* wakeup pin edge selection */
#if defined (GD32F5HC)
void pmu_wakeup_pin_edge_select(uint32_t wakeup_pin_edge, uint32_t edge_type);
#endif /* defined GD32F5HC */

/* backup related functions */
/* backup domain write enable */
void pmu_backup_write_enable(void);
/* backup domain write disable */
void pmu_backup_write_disable(void);

/* WIFI & SRAM functions */
#if defined (GD32W515)
/* enable WIFI power */
void pmu_wifi_power_enable(void);
/* disable WIFI power */
void pmu_wifi_power_disable(void);
/* WIFI low power control */
void pmu_wifi_low_power_control(uint32_t wifi_lpwr_cfg);
#endif /* defined (GD32W515) */
/* SRAM low power control */
void pmu_sram_low_power_control(uint32_t sram_lpwr_cfg);

#if defined (GD32W515)
/* RF functions */
/* RF sequence force open/close */
void pmu_rf_force_enable(uint32_t force);
/* disable RF sequence open/close force */
void pmu_rf_force_disable(uint32_t force);
/* RF sequence configuration */
void pmu_rf_sequence_config(uint32_t mode);
#endif /* defined (GD32W515) */

/* security & privilege functions */
/* enable the security attribution */
void pmu_security_enable(uint32_t security);
/* disable the security attribution */
void pmu_security_disable(uint32_t security);
/* enable the privileged access */
void pmu_privilege_enable(void);
/* disable the privileged access */
void pmu_privilege_disable(void);

/* flag functions */
/* get flag status */
FlagStatus pmu_flag_get(uint32_t flag);
/* clear flag bit */
void pmu_flag_clear(uint32_t flag);

#endif /* gd32w51x_f5hc_PMU_H */
